<template>
    <div id="example">
      <hot-table
        ref="hotTableComponent"
        :data="data"
        :settings="hotSettings"
      ></hot-table>
    </div>
  </template>
  
  <script>
  import { defineComponent } from "vue";
  import { HotTable } from "@handsontable/vue3";
  import { registerAllModules } from "handsontable/registry";
  import "handsontable/dist/handsontable.full.css";
  
  // register Handsontable's modules
  registerAllModules();
  
  export default defineComponent({
    data() {
      return {
        data: [
          [
            "САНХҮҮГИЙН БАЙДЛЫН ТАЙЛАН",
            "",
            "",
            "",
            "",
          ],
          [
            "( Аж ахуйн нэгж, байгууллагын нэр )",
            "",
            "",
            "",
            "",
          ],
          [
            "Мөрийн дугаар",
            "Үзүүлэлт",
            "2016 оны 12-р сарын 31",
            "2017 оны 06-р сарын 30",
            "",
          ],
          [
            "1",
            "ХӨРӨНГӨ",
            "",
            "",
            "",
          ],
          [
            "1.1",
            "Эргэлтийн хөрөнгө",
            "",
            "",
            "",
          ],
          [
            "1.1.1",
            "Мөнгө, түүнтэй адилтгах хөрөнгө",
            "1,000,000",
            "",
            "756,446,126",
          ],
          [
            "1.1.2",
            "Дансны авлага		",
            "",
            "",
            "",
          ],
          [
            "1.1.3		",
            "Татвар, НДШ-ийн авлага		",
            "",
            "",
            "",
          ],
          [
            "1.1.4		",
            "Бусад авлага		",
            "",
            "",
            "",
          ],
          [
            "1.1.5		",
            "Бусад санхүүгийн хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.1.6		",
            "Бараа материал		",
            "",
            "",
            "",
          ],
          [
            "1.1.7		",
            "Урьдчилж төлсөн зардал/тооцоо		",
            "",
            "",
            "",
          ],
          [
            "1.1.8		",
            "Бусад эргэлтийн хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.1.9		",
            "Борлуулах зорилгоор эзэмшиж буй эргэлтийн бус хөрөнгө (борлуулах бүлэг хөрөнгө)		",
            "",
            "",
            "",
          ],
          [
            "1.1.10		",
            "",
            "",
            "",
            "",
          ],
          [
            "1.1.11		",
            "Эргэлтийн хөрөнгийн дүн		",
            "  1,000,000 	",
            "",
            "",
          ],
          [
            "1.2		",
            "     Эргэлтийн бус хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.1		",
            "Үндсэн хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.2		",
            "Биет бус хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.3		",
            "Биологийн хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.4		",
            "Урт хугацаат хөрөнгө оруулалт		",
            "",
            "",
            "",
          ],
          [
            "1.2.5		",
            "Хайгуул ба үнэлгээний хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.6		",
            "Хойшлогдсон татварын хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.7		",
            "Хөрөнгө оруулалтын зориулалттай үл хөдлөх хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.8		",
            "Бусад эргэлтийн бус хөрөнгө		",
            "",
            "",
            "",
          ],
          [
            "1.2.9		",
            "",
            "",
            "",
            "",
          ],
          [
            "1.2.10		",
            "Эргэлтийн бус хөрөнгийн дүн		",
            "",
            "",
            "",
          ],
          [
            "1.3		",
            "НИЙТ ХӨРӨНГИЙН ДҮН		",
            "  1,000,000 	",
            "",
            "",
          ],
          [
            "2		",
            "ӨР ТӨЛБӨР БА ЭЗДИЙН ӨМЧ		",
            "",
            "",
            "",
          ],
          [
            "2.1		",
            "     ӨР ТӨЛБӨР		",
            "",
            "",
            "",
          ],
          [
            "2.1.1		",
            "     Богино хугацаат өр төлбөр		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.1		",
            "Дансны өглөг		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.2		",
            "Цалингийн өглөг		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.3		",
            "Татварын өглөг		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.4		",
            "НДШ-ийн өглөг		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.5		",
            "Богино хугацаат зээл		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.6		",
            "Хүүний өглөг		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.7		",
            "Ногдол ашгийн өглөг		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.8		",
            "Урьдчилж орсон орлого		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.9		",
            "Нөөц /өр төлбөр/		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.10		",
            "Бусад богино хугацаат өр төлбөр		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.11		",
            "Борлуулах зорилгоор эзэмшиж буй эргэлтийн бус хөрөнгө (борлуулах бүлэг хөрөнгө)-нд хамаарах өр төлбөр		",
            "",
            "",
            "",
          ],
          [
            "2.1.1.13		",
            "Богино хугацаат өр төлбөрийн дүн		",
            "",
            "",
            "",
          ],
          [
            "2.1.2		",
            "     Урт хугацаат өр төлбөр		",
            "",
            "",
            "",
          ],
          [
            "2.1.2.1		",
            "Урт хугацаат зээл		",
            "",
            "",
            "",
          ],
          [
            "2.1.2.2		",
            "Нөөц /өр төлбөр/		",
            "",
            "",
            "",
          ],
          [
            "2.1.2.3		",
            "Хойшлогдсон татварын өр		",
            "",
            "",
            "",
          ],
          [
            "2.1.2.4		",
            "Бусад урт хугацаат өр төлбөр		",
            "",
            "",
            "",
          ],
          [
            "2.1.2.5		",
            "",
            "",
            "",
            "",
          ],
          [
            "2.1.2.6		",
            "Урт хугацаат өр төлбөрийн дүн		",
            "",
            "",
            "",
          ],
          [
            "2.2		",
            "ӨР ТӨЛБӨРИЙН НИЙТ ДҮН		",
            "",
            "",
            "",
          ],
          [
            "2.3		",
            "     ЭЗДИЙН ӨМЧ		",
            "",
            "",
            "",
          ],
          [
            "2.3.1		",
            "Өмч: а) төрийн		",
            "",
            "",
            "",
          ],
          [
            "2.3.2		",
            "         б) хувийн		",
            "  1,000,000 	",
            "",
            "",
          ],
          [
            "2.3.3		",
            "         в) хувьцаат		",
            "",
            "",
            "",
          ],
          [
            "2.3.4		",
            "Халаасны хувьцаа		",
            "",
            "",
            "",
          ],
          [
            "2.3.5		",
            "Нэмж төлөгдсөн капитал		",
            "",
            "",
            "",
          ],
          [
            "2.3.6		",
            "Хөрөнгийн дахин үнэлгээний нэмэгдэл		",
            "",
            "",
            "",
          ],
          [
            "2.3.7		",
            "Гадаад валютын хөрвүүлэлтийн нөөц		",
            "",
            "",
            "",
          ],
          [
            "2.3.8		",
            "Эздийн өмчийн бусад хэсэг		",
            "",
            "",
            "",
          ],
          [
            "2.3.9		",
            "Хуримтлагдсан ашиг		",
            "",
            "",
            "- 35,958,996 ",
          ],
          [
            "2.3.10		",
            "",
            "",
            "",
            "",
          ],
          [
            "2.3.11		",
            "ЭЗДИЙН ӨМЧИЙН ДҮН		",
            "  1,000,000 	",
            "- 35,958,996 ",
            "",
          ],
          [
            "2.4		",
            "ӨР ТӨЛБӨР БА ЭЗДИЙН ӨМЧИЙН ДҮН		",
            "  1,000,000 	",
            "- 35,958,996 ",
            "",
          ],
          [
            "",
            "",
            "",
            "",
            "- 35,958,996.4 ",
          ],
          [
            "",
            "Захирал :			",
            "",
            "",
            "",
          ],
          [
            "",
            "Ерөнхий нягтлан бодогч :			",
            "",
            "",
            "",
          ],
          
          

          

         
        ],
        hotSettings: {
          mergeCells: [
            { row: 0, col: 0, rowspan: 1, colspan: 5 },
            { row: 65, col: 1, rowspan: 1, colspan: 4 },
            { row: 66, col: 1, rowspan: 1, colspan: 4 },
          ],
          cell: [
            { row: 0, col: 0, className: 'htCenter'}
          ],
          licenseKey: "non-commercial-and-evaluation",
        },
      };
    },
    components: {
      HotTable,
    },
  });
  </script>