
]<template>
  <hot-table
    :settings="settings"
    licenseKey="non-commercial-and-evaluation"
    :data="data"
    :rowHeaders="true"
    :colHeaders="true"></hot-table>
</template>

<script>
import { defineComponent } from "vue";
import { HotTable } from "@handsontable/vue3";
import { registerAllModules } from "handsontable/registry";
import "handsontable/dist/handsontable.full.css";

// register Handsontable's modules
registerAllModules();

export default defineComponent({
  data() {
    return {
      data: [
        [
          "Д.д",
          "Огноо",
          "Дансны дугаар",
          "Дансны нэр",
          "Дебит / Кредит",
          "Харилцагч",
          "Гүйлгээний утга",
          "Дүн",
          "МГТ-ын мөр",
          "ТТ02 зам",
        ],
        [
    1,
    "11/21/2019",
    1201,
    "авлага",
    "D",
    "ABC",
    10000,
    "Борлуулалт",
    "1.1.1"
  ]
        ,
        [
    2,
    "11/21/2019",
    5101,
    "Брлт орлого",
    "C",
    "ABC",
    "Борлуулалт",
    10000
],
[
    3,
    "11/21/2019",
    7022,
    "түрээс",
    "D",
    "DEF",
    "ТҮрээс",
    5000
],
[
    2,
    "11/21/2019",
    1103,
    "Банкны данс",
    "C",
    "DEF",
    "ТҮрээс",
    3000,
    "1.2.4"
],
[
    2,
    "11/21/2019",
    3104,
    "Түрээсийн өглөг",
    "C",
    "DEF",
    "ТҮрээс",
    2000
],
[
    3,
    "11/30/2019",
    7013,
    "Татварын зардал",
    "D",
    "MTA",
    "Татвар тооцов",
    50
],
[
    3,
    "11/30/2019",
    3109,
    "ааноат",
    "C",
    "MTA",
    "Татвар тооцов",
    50
],
[
    4,
    "11/30/2019",
    4201,
    "хур. ашиг",
    "D",
    "",
    "Хаалтын бичилт",
    35958996
],
[
    4,
    "11/30/2019",
    9001,
    "OZND",
    "C",
    "",
    "Хаалтын бичилт",
    35958996
],
[
    5,
    "11/15/2019",
    1001,
    "Касс",
    "C",
    "",
    "Цалингийн Урьдчилгаа",
    10082811,
    "1.2.1"
],
[
    5,
    "11/15/2019",
    9002,
    "Цалингийн тооцоо",
    "D",
    "",
    "Цалингийн Урьдчилгаа",
    10082811
],
[6, "11/30/2019", 7001, "Цалин зардал (Уд)", "D", "", "Сүүл.цалин", 21512500],
    [6, "11/30/2019", 7002, "Цалин зардал (Бор)", "D", "", "Сүүл.цалин", 5874192],
    [6, "11/30/2019", 9002, "Цалингийн тооцоо", "C", "", "Сүүл.цалин", 10082811],
    [6, "11/30/2019", 3106, "ндш өглөг", "C", "", "Сүүл.цалин", 2598095],
    [6, "11/30/2019", 3103, "хаоат өглөг", "C", "", "Сүүл.цалин", 2196873],
    [6, "11/30/2019", 1001, "Касс", "C", "", "Сүүл.цалин", 12508913, "1.2.1"],
    [7, "11/30/2019", 7011, "НДШ зардал (Уд)", "D", "", "Байгууллагын НДШ", 2689063],
    [7, "11/30/2019", 7012, "НДШ зардал (Бор)", "D", "", "Байгууллагын НДШ", 734274],
    [7, "11/30/2019", 3106, "ндш өглөг", "C", "", "Байгууллагын НДШ", 3423336],
    ["COST IMPORT1", "2019/11/3", 6101, "ББӨ", "D", "", "COST IMPORT", 136000],
    ["COST IMPORT1", "2019/11/3", 1501, "Бараа мат", "C", "", "COST IMPORT", 136000],
    ["COST IMPORT2", "2019/11/8", 6101, "ББӨ", "D", "", "COST IMPORT", 710769],
    ["COST IMPORT2", "2019/11/8", 1501, "Бараа мат", "C", "", "COST IMPORT", 710769],
    ["COST IMPORT3", "2019/11/9", 6101, "ББӨ", "D", "", "COST IMPORT", 17769],
    ["COST IMPORT3", "2019/11/9", 1501, "Бараа мат", "C", "", "COST IMPORT", 17769],
    ["COST IMPORT4", "2019/11/9", 6101, "ББӨ", "D", "", "COST IMPORT", 14215],
    ["COST IMPORT4", "2019/11/9", 1501, "Бараа мат", "C", "", "COST IMPORT", 14215],
    ["COST IMPORT5", "2019/11/9", 6101, "ББӨ", "D", "", "COST IMPORT", 10662],
    ["COST IMPORT5", "2019/11/9", 1501, "Бараа мат", "C", "", "COST IMPORT", 10662],
    ["COST IMPORT6", "2019/11/10", 6101, "ББӨ", "D", "", "COST IMPORT", 108218],
    ["COST IMPORT6", "2019/11/10", 1501, "Бараа мат", "C", "", "COST IMPORT", 108218],
    ["SALES1", "2019/11/3", 1001, "Касс", "D", "Sales @43772", "", 204000, "1.1.1"],
    ["SALES1", "2019/11/3", 5101, "Брлт орлого", "C", "Sales @43772", "", 204000],
    ["SALES2", "2019/11/8", 1001, "Касс", "D", "Sales @43777", "", 1066154, "1.1.1"],
    ["SALES2", "2019/11/8", 5101, "Брлт орлого", "C", "Sales @43777", "", 1066154],
    ["SALES3", "2019/11/9", 1001, "Касс", "D", "Sales @43778", "", 26654, "1.1.1"],
    ["SALES3", "2019/11/9", 5101, "Брлт орлого", "C", "Sales @43778", "", 26654],
    ["SALES4", "2019/11/9", 1001, "Касс", "D", "Sales @43778", "", 21323, "1.1.1"],
    ["SALES4", "2019/11/9", 5101, "Брлт орлого", "C", "Sales @43778", "", 21323],
    ["SALES5", "2019/11/9", 1001, "Касс", "D", "Sales @43778", "", 15992, "1.1.1"],
    ["SALES5", "2019/11/9", 5101, "Брлт орлого", "C", "Sales @43778", "", 15992],
    ["SALES6", "2019/11/10", 1001, "Касс", "D", "Sales @43779", "", 162327, "1.1.1"],
    ["SALES6", "2019/11/10", 5101, "Брлт орлого", "C", "Sales @43779", "", 162327],
    ["FA1", "7/1/2019", 2001, "Үндсэн хөр.", "D", "", "ҮХ худалдаж авав", 222465600],
    ["FA1", "7/1/2019", 1001, "Касс", "C", "", "ҮХ худалдаж авав", 222465600, "2.2.1"],
    ["FA2", "12/31/2019", 7005, "элэгдэл", "D", "", "Элэгдэл тооцов", 12261201],
    ["FA2", "12/31/2019", 2010, "Үх-н хур.эл.", "C", "", "Элэгдэл тооцов", 12261201],
      ],
    };
  },
  components: {
    HotTable,
  },
});
</script>
